# Volatility    -00
# Copyright (c) 2010, 2011, 2012, 2013 Jamaal Speights <jamaal.speights@gmail.com>
#
# This program is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; either version 2 of the License, or (at
# your option) any later version.
#
# This program is distributed in the hope that it will be useful, but
# WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
# General Public License for more details. 
#
# You should have received a copy of the GNU General Public License
# along with this program; if not, write to the Free Software
# Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA 

# ETHSCAN - Recover ethernet packets from memory 
# 
# This plugin will attempt to recovere packets from memory. 
# Packets found in memory can be saved as individual raw binary files or 
# each packet will be saved to a pcap file.  
#
#
#ProcName: VMip.exe PID: 180  Base Address: 0x162000  End Address: 0x163000
#IPv4 (0x0800) 
#Protocol UDP (17)
#Src: 172.16.176.1:31982 (00:50:56:c0:00:08), Dst: 172.16.176.255:35072 (ff:ff:ff:ff:ff:ff)
#Data (92 Bytes)
#0x00000000  ff ff ff ff ff ff 00 50 56 c0 00 08 08 00 45 00   .......PV.....E.
#0x00000010  00 4e 97 dc 00 00 40 11 29 a1 ac 10 b0 01 ac 10   .N....@.).......

        0x85:  'FC', 
        0x86:  'RSVP-E2E-IGNORE', 
        0x87:  'Mobility Header', 
        0x88:  'UDP Lite', 
        0x89:  'MPLS-in-IP', 
        0x8A:  'manet', 
        0x8B:  'HIP', 
        0x8C:  'Shim6', 
        0xFE:  'Unknown'
}


# // <ethernet future eth types > // 
ethertypes = {
    0x0800:  'IPv4', 
    0x0806:  'ARP', 
    0x0842:  'Wake-on-LAN', 
    0x22F3:  'IETF TRILL Protocol', 
    0x6003:  'DECnet Phase IV', 
    0x8035:  'Reverse ARP', 
    0x809B:  'AppleTalk', 
    0x80F3:  'AppleTalk ARP', 
    0x8100:  'VLAN-tagged', 
    0x8137:  'IPX', 
    0x8138:  'IPX', 
    0x8204:  'QNX Qnet', 
    0x86DD:  'IPv6', 
    0x8808:  'Ethernet flow control', 
    0x8809:  'Slow Protocols (IEEE 802.3)', 
    0x8819:  'CobraNet', 
    0x8847:  'MPLS unicast', 
    0x8848:  'MPLS multicast', 
    0x8863:  'PPPoE Discovery Stage', 
    0x8864:  'PPPoE Session Stage', 
    0x8870:  'Jumbo Frames', 
    0x887B:  'HomePlug 1.0 MME', 
    0x888E:  'IEEE 802.1X', 
    0x8892:  'PROFINET Protocol', 
    0x889A:  'SCSI over Ethernet', 
    0x88A2:  'ATA over Ethernet', 
    0x88A4:  'EtherCAT', 
    0x88A8:  '802.1ad & IEEE 802.1aq', 
    0x88AB:  'Ethernet Powerlink', 
    0x88CC:  'LLDP', 
    0x88CD:  'SERCOS', 
    0x88E1:  'HomePlug AV MME', 
    0x88E3:  'Media Redundancy Protocol (IEC62439-2)', 
    0x88E5:  'MAC security (IEEE 802.1AE)', 
    0x88F7:  'Precision Time Protocol (IEEE 1588)', 
    0x8902:  'IEEE 802.1ag', 
    0x8906:  'FCoE', 
    0x8914:  'FCoE Initialization Protocol', 
    0x8915:  'RDMA over Converged Ethernet (RoCE)', 
    0x9000:  'Ethernet Configuration Testing Protocol', 
    0x9100:  'Q-in-Q', 
    0xCAFE:  'Veritas Low Latency Transport (LLT)'
}             

ether_current_types = {
    0x0800:  'IPv4', 
    0x86DD:  'IPv6', 
}             

ipv4pkt = {
            'ethDst' :'',
            'ethSrc': '',     
            'ethType': '',
            'ipv4Ver': '',
            'ipv4DSF':'',
            'ipv4TotalLen': '',
            'ipv4IDENT': '',
            'ipv4FLAG': '',
            'ipv4TTL': '', 
            'ipv4ProtoType': '',
            'ipv4Checksum': '',
            'ipv4Source': '',
            'ipv4Dst': '',
             'ipv4SrcPort': '',
             'ipv4DstPort': ''  
    }

ipv6pkt = {
             'ethv6Dst':'',                 # //<IPV6  Frame & Packet Structure
             'ethv6Src': '',                 
             'ipv6Ver': '',
            'ipv6TotalLen':'',
            'ipv6NextHeader': '',
            'ipv6CheckSumUDP': '',
            'ipv6CheckSumTCP': '',
            'ipv6Src': '',
            'ipv6Dst':''
    }
      
        
class PacketDataClass(object):
    """PacketDataClass Class returns Ethernet and Protocol types by get_ethtype and get_prototye methods"""
    def __init__(self):
        self.MTU = 1500
        self.checksum = ""
        self.checksumValue = 0 
        self.IPv4Header = 0x0800
        self.IPv6Header = 0x86DD        
        self.IPv4 =  struct.pack('>H', self.IPv4Header)   
        self.IPv6 =  struct.pack('>H', self.IPv6Header)   
        self.ethertypes = ethertypes
        self.protocols = protocols
              
    def checksum_ipv4(self, data):
        """checksum vlidation for ipv4,  Returns zero on success"""
        z=0 
        carry_byte=rbytes=""
        for i in range(0, len(data) - 1, 2):
            z += struct.unpack('>H', data[i:i+2])[0]
        checksum = hex(z)[2:]
        carry_byte = checksum[0]
        rbytes= checksum[1:] #remainder_bytes
        checksum = int(rbytes, 0x10)+int(carry_byte, 0x10)
        return (~checksum & 0xFFFF)   #verified bytes   
        
    def ipv6_ispktValid(self, eth):
        """ Checks last 3 bytes of Src/Dst Addr to last 6 bytes of Src/Dst Mac address 
              Bytes should be equal validing the packet as IPv6 """
                
        ethsrcbytes = eth.obj_vm.read(eth.ethv6Src.obj_offset, 6)
        ethdstbytes = eth.obj_vm.read(eth.ethv6Dst.obj_offset, 6)

        ipsrcbytes = eth.obj_vm.read(eth.ipv6Src.obj_offset,  eth.ipv6Src.size())
        ipdstbytes = eth.obj_vm.read(eth.ipv6Dst.obj_offset,  eth.ipv6Dst.size())
        
        return any((ethsrcbytes[-3:], ethdstbytes[-3:], ipsrcbytes[-3:], ipdstbytes[-3:]))
    
    
    def get_ethtype(self, lookup):
        """ returns the ethernet type from lookup (int) returning (Pv4(str)  2048(int) 0x0800(str))"""
        ethnum = lookup
        ethstr = self.ethertypes.get(ethnum, "Unknown")
        ethnumstr = "0x%04X" % ethnum
        return ethstr, ethnum, ethnumstr  
        
    def get_prototye(self, lookup):
        """ returns the protocol type from lookup (int) returning (TCP(str), 6(int) 0x6(str))"""
        protonum = lookup
        protostr = self.protocols.get(protonum, "Unknown")
        protonumstr = "0x%04X" % protonum        
        return protostr,protonum, protonumstr

    def check_IPV4(self, eth):
        """returns True if frame has valid IPv4 packet"""
        if eth.ipv4Ver & 0xF0 == 0x40: 
            if eth.ipv4TotalLen <= self.MTU:
                self.checksum = ''.join([chr(cs) for cs in eth.ipv4CheckSumArray])
                self.checksumValue = self.checksum_ipv4(self.checksum)

                if self.checksumValue == 0:
                    return True 
                else:
                    return False 
                    
    def check_IPV6(self, eth):
        """returns True if frame has valid IPv4 packet"""
        
        if eth.ipv6Ver == 0x60:  # //<fix this 
            if eth.ethType ==  0x86dd:
                self.ipv6_ispktValid(eth)
                return True
            else:
                return False
            
            
class EthScanVTypes(obj.ProfileModification):
    """ EthScanVTypes packet structure """
    
    def modification(self, profile):        
        """updates profile with ethVtype which helps define frame/packet data structure for ethernet/ipv4/ipv6 """
        ethVtype = {
        'ethFrame': [ 0x0, {
            'ethDst' : [ 0x0, ['array', 6,  ['unsigned char']]],
            'ethSrc': [ 0x6, ['array', 6,  ['unsigned char']]],       
            'ethType': [ 0x0c, ['unsigned be short']],         
            'ipv4Ver': [0x0e, ['unsigned char']], 
            'ipv4CheckSumArray': [ 0x0e, ['array', 20,  ['unsigned char']]],            
            'ipv4DSF': [0xf, ['unsigned char']], 
            'ipv4TotalLen': [0x10, ['unsigned be short']], 
            'ipv4IDENT': [0x12, ['unsigned be short']], 
            'ipv4FLAG': [0x14, ['unsigned char']],
            'ipv4OffSet': [0x14, ['unsigned short']],         # //<ipv4OffSet = ipv4FLAG offset + size of 2 bytes >//
            'ipv4TTL': [0x16, ['unsigned char']],  
            'ipv4ProtoType': [0x17, ['unsigned char']],  
            'ipv4Checksum': [0x18, ['unsigned be short']],  
            'ipv4Source': [0x1a, ['IpAddress']],  
            'ipv4Dst': [0x1e, ['IpAddress']],  
             'ipv4SrcPort' : [0x22, ['unsigned short']],  
             'ipv4DstPort' : [0x24, ['unsigned short']],  
             'ethv6Dst': [0x0, ['Ipv6Address']],                 # //<IPV6  Frame & Packet Structure
             'ethv6Src': [0x6, ['Ipv6Address']],                 
             'ipv6Ver': [0x0e, ['unsigned char']], 
            'ipv6TotalLen': [0x12, ['unsigned be short']],             
            'ipv6NextHeader': [0x14, ['unsigned char']], 
            'ipv6CheckSumUDP': [0x38, ['unsigned be short']],     
            'ipv6CheckSumTCP': [0x46, ['unsigned be short']],          
            'ipv6Src': [0x16, ['Ipv6Address']],  
            'ipv6Dst': [0x26, ['Ipv6Address']],  
            'ipv6SrcPort': [0x36, ['unsigned be short']],     
            'ipv6DstPort': [0x38, ['unsigned be short']],     
                            }], 
        }
        profile.vtypes.update(ethVtype)
        
class FindEthFrame(scan.ScannerCheck):
    """ ScannerCheck to verify the IPv4 protocol, standard header length and protocol """
    def __init__(self, address_space, needles = None):
        scan.ScannerCheck.__init__(self, address_space) 
        self.packet =  PacketDataClass()
        self.ipv4 = self.packet.IPv4    # //<0x0800 (bin)
        self.ipv6 = self.packet.IPv6    # //<0x86dd (bin)
        self.ipv4Header = self.packet.IPv4Header    #0x0800 (int)
        self.ipv6Header = self.packet.IPv6Header    #0x86dd (int)
        self.MTU = self.packet.MTU
        self.nextvalv4 = 0 
        self.nextvalv6  = 0 
        self.nextValue = 0 
        

    def check(self, offset):
        """checks for valid ipv4/ipv6 packets"""    

        eth = obj.Object('ethFrame', vm = self.address_space, offset = offset)
        
        # //<IPv4 header check so check_IPV4() method isnt called needlesssly 
        if eth.ethType == self.ipv4Header:
            if self.packet.check_IPV4(eth):
                return eth

        if eth.ethType == self.ipv6Header:
            if self.packet.check_IPV6(eth):
                return eth

    # //<Skip bytes based upon ethertypes from the PacketDataClass Class 
    def skip(self, data, offset):
        try:
            self.nextvalv4 = data.index(self.ipv4, offset + 1)
            self.nextvalv6 = data.index(self.ipv6, offset + 1)
            
            if self.nextvalv4 != self.nextvalv6:
                self.nextValue = min(self.nextvalv4, self.nextvalv6)
            else:
                self.nextValue = max(self.nextvalv4, self.nextvalv6)
            
            # //<return() 
            # //<len(self.ipv4) == 2 
            # //<0xC = ethFrame start 
            return (self.nextValue-len(self.ipv4)-0xC)-offset 
            
        except ValueError:
            print "Checking next buffer",  hex(len(data) - offset)
            # //<Substring is not found - skip to the end of this data buffer
            return len(data) - offset            
            
class EthScanner(scan.BaseScanner):
    checks = [('FindEthFrame', {})]

class EthDisplayControl(taskmods.DllList):
    """Controls data, options and text formatting"""    
    def __init__(self, config, address_space, *args, **kwargs):
        taskmods.DllList.__init__(self, config, *args, **kwargs)
        self.config = config         
        self.config.remove_option("OFFSET")        
        self.address_space = address_space
        self.IPv4Header = 0x0800
        self.IPv6Header = 0x86DD           
        self.ipv4pkt = ipv4pkt
        self.ipv6pkt = ipv6pkt
        self.pktbuilt = False 
        self.etype = None 
        self.protocols = protocols
        self.ethertypes = ether_current_types
        self.filterset = 0 
        self.tmppkt = ""
        self.pkt_string = "" 
        self.counter = 1
        
        # //< self.taskobj = self.get_tasks() >//
        # //<self.get_task() returns either a task object or False  >//
        # //<if it returns a task object, we know we're on a windows system >//
        # //<[ self.windows = 1 means windows system] >//
        # //<else [ self.windows = 0 ] which means non windows system >
        # //<this allows ethscan to know if it should call get_packet_process()  >//
        # //<get_packet_process() finds the associated process per packet  >//
        # //<without this check ethscan would not work on none windows images  >//
        
        self.taskobj = self.get_tasks()
        if self.taskobj.next() == False  or self.config.ENABLE_PROC == False:
            self.windows = 0 
        else:
            self.windows = 1 
            self.ptpobj = self.get_tasks() 
            #// self.templist = list(self.ptpobj)
